Тест-кейсы
1 Ввод правильных данных
Шаги для воспроизведения:
1. Открыть https://demoqa.com/text-box
2. В поле "Full name" ввести имя кириллицей
3. В поле "Email" ввести латинскими буквами е-мейл по шаблону [почта]@[домен].com
4. В поле "Current Address" написать название любого города кириллицей
5. В поле "Permanent Address" написать название любого города кириллицей
6. Нажать кнопку "Submit"
Ожидаемый результат:
Произойдет Сабмит, данные отобразятся в отдельном окне

2 Сабмит с некорректным е-мейлом
Шаги для воспроизведения:
1. Открыть https://demoqa.com/text-box
2. В поле "Full name" ввести имя кириллицей
3. В поле "Email" ввести е-мейл по шаблону [почта]@[домен]
4. Нажать кнопку "Submit"
Ожидаемый результат:
Сабмит не произойдет, поле с емейлом подсветится красной рамкой

3 Сабмит с длинным именем
Шаги для воспроизведения:
1. Открыть https://demoqa.com/text-box
2. В поле "Full name" ввести любые символы, количеством 21
3. В поле "Email" ввести е-мейл по шаблону [почта]@[домен].com
4. Нажать кнопку "Submit"
Ожидаемый результат:
Сабмит не произойдет, поле "Full name" подсветится красной рамкой

4 Сабмит с длинным адресом "Current Address"
Шаги для воспроизведения:
1. Открыть https://demoqa.com/text-box
2. В поле "Full name" ввести имя кириллицей
3. В поле "Email" ввести латинскими буквами е-мейл по шаблону [почта]@[домен].com
4. В поле "Current Address" ввести любые символы, количеством 51
5. В поле "Permanent Address" написать название любого города кириллицей
6. Нажать кнопку "Submit"
Ожидаемый результат:
Сабмит не произойдет, поле "Current Address" подсветится красной рамкой

4 Сабмит с длинным адресом "Permanent Address"
1 Ввод правильных данных
Шаги для воспроизведения:
1. Открыть https://demoqa.com/text-box
2. В поле "Full name" ввести имя кириллицей
3. В поле "Email" ввести латинскими буквами е-мейл по шаблону [почта]@[домен].com
4. В поле "Current Address" написать название любого города кириллицей
5. В поле "Permanent Address" ввести любые символы, количеством 51
6. Нажать кнопку "Submit"
Ожидаемый результат:
Сабмит не произойдет, поле "Permanent Address" подсветится красной рамкой
